Revit 2027 API
SpatialFieldManager.SetMeasurementDescriptions Method
 Sets Descriptions for all measurements
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMeasurementDescriptions(
	IList<string> measurementDescriptions
)
Public Sub SetMeasurementDescriptions (
	measurementDescriptions As IList(Of String)
)
public:
void SetMeasurementDescriptions(
	IList<String^>^ measurementDescriptions
)
member SetMeasurementDescriptions :
        measurementDescriptions : IList<string> -> unit
Parameters
measurementDescriptions IList<String>
 Array of measurement descriptions. The lengths of the array must be equal to the number of measurements set during creation of SpatialFieldManager.
Exceptions
Exception | Condition
ArgumentException |  measurementDescriptions lengths is not equal to the number of measurements set during creation of SpatialFieldManager
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace